## Plan Result (reform_cft_vh_dev_acme)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.app-proxy-ga-service-connection-certificate-management




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.app-proxy-ga-service-connection-certificate-management will be created
  + resource "azurerm_role_assignment" "app-proxy-ga-service-connection-certificate-management" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/resourceGroups/cft-platform-dev-rg/providers/Microsoft.KeyVault/vaults/acmereformcftvhdev"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":28,"Program":"tfcmt","SHA1":"","Target":"reform_cft_vh_dev_acme","Vars":{}} -->